Repository: adelonem/sudoku
Catalog: Sudoku/Resources/Localizable.xcstrings
Source language: en
Languages: fr, zh_hans

source: Simple Coloring on %lld: two cells of the same color see each other — this color can be eliminated.
fr: Coloriage simple sur %lld : deux cellules de même couleur se voient — cette couleur peut être éliminée.
zh_hans: 简单着色法（%lld）：同色的两个单元格互相可见——该颜色可以被排除。

source: Skyscraper
fr: Gratte-ciel
zh_hans: 摩天楼

source: Skyscraper on %lld: the two non-shared wings allow eliminating %lld from cells that see both.
fr: Gratte-ciel sur le %1$lld : les deux ailes non-partagées permettent d'éliminer %2$lld des cellules qui les voient toutes les deux.
zh_hans: 摩天楼（%1$lld）：两个非共享翼可以从能同时看到两者的单元格中排除%2$lld。

source: Skyscraper on %1$lld: the two roof cells force %2$lld into one of them, so any cell seeing both roofs loses %3$lld.
fr: Skyscraper sur %1$lld : les deux cellules du toit forcent %2$lld dans l'une d'elles, donc toute cellule voyant les deux toits perd %3$lld.
zh_hans: 数字%1$lld的摩天楼：两个屋顶单元格迫使%2$lld落在其中之一，因此任何同时看到两个屋顶的单元格都要删除%3$lld。

# So %@ must use one of its extra candidates: %@.
source: So %1$@ must use one of its extra candidates: %2$@.
fr: %1$@ doit donc utiliser l'un de ses candidats supplémentaires : %2$@.
zh_hans: 因此，%1$@必须使用它的一个额外候选数：%2$@。

source: So the opposite color must be true in %@.
fr: La couleur opposée doit donc être vraie dans %1$@.
zh_hans: 因此，对立颜色必须在%1$@中成立。

source: Start Playing
fr: Commencer à jouer
zh_hans: 开始游戏

source: Starting board
fr: Grille de départ
zh_hans: 初始棋盘

source: Tap a cell to add or remove a note
fr: Touchez une case pour ajouter ou retirer une note
zh_hans: 点击格子以添加或移除笔记

source: Tap a digit first
fr: Touchez d'abord un chiffre
zh_hans: 先点选一个数字

source: Tap to finish automatically
fr: Touchez pour terminer automatiquement
zh_hans: 点击自动完成

source: Teal
fr: Sarcelle
zh_hans: 蓝绿色

source: That chain makes the grid impossible.
fr: Cette chaîne rend la grille impossible.
zh_hans: 这条链会使棋盘变得不可能。

source: That color is impossible, so the opposite color survives in %@.
fr: Cette couleur est impossible, donc la couleur opposée reste dans %1$@.
zh_hans: 这种颜色不可能成立，因此对立颜色保留在%1$@中。

source: That leaves the two roof cells %1$@ and %2$@ as the only non-shared options for %3$lld.
fr: Il ne reste alors que les deux cellules du toit %1$@ et %2$@ comme seules options non partagées pour %3$lld.
zh_hans: 这样一来，屋顶单元格%1$@和%2$@就成为%3$lld仅剩的两个非共享位置。

source: The %lld cells (%@) share exactly candidates %@.
fr: Les %1$lld cellules (%2$@) partagent exactement les candidats %3$@.
zh_hans: %1$lld个单元格（%2$@）恰好共享候选数%3$@。

source: The arrow in the header restores your previous move.
fr: La flèche dans l'en-tête rétablit votre coup précédent.
zh_hans: 标题栏中的箭头可以恢复你的上一步操作。

source: The board already reflects the previous eliminations. The highlighted action explains the next candidates to remove.
fr: La grille reflète déjà les éliminations précédentes. L'action mise en évidence explique les prochains candidats à supprimer.
zh_hans: 棋盘已反映之前的删除。高亮操作说明接下来要删除的候选数。

source: The chain keeps propagating until the grid becomes impossible.
fr: La chaîne continue de se propager jusqu'à rendre la grille impossible.
zh_hans: 这条链会持续传播，直到棋盘变得不可能。

# The extra fin at %@ keeps the eliminations inside box (%lld,%lld).
source: The extra fin at %1$@ keeps the eliminations inside box (%2$lld,%3$lld).
fr: L'aileron supplémentaire en %1$@ maintient les éliminations à l'intérieur de la boîte (%2$lld,%3$lld).
zh_hans: 位于%1$@的额外鳍将删除限制在宫（%2$lld,%3$lld）内。

source: The numbers given at the start cannot be changed.
fr: Les chiffres donnés au départ ne peuvent pas être modifiés.
zh_hans: 开局给出的数字不能被修改。

source: The same color appears in two cells that see each other: %@.
fr: La même couleur apparaît dans deux cellules qui se voient : %1$@.
zh_hans: 相同颜色出现在两个彼此可见的单元格中：%1$@。

source: the same color would force two candidates in %@ at once
fr: la même couleur forcerait deux candidats à la fois dans %1$@
zh_hans: 相同颜色会同时在%1$@中强制两个候选数

source: These %lld digits can only go in these %lld cells of %@.
fr: Ces %1$lld chiffres ne peuvent aller que dans ces %2$lld cellules de %3$@.
zh_hans: 这%1$lld个数字只能放在%3$@的这%2$lld个单元格中。

source: These digits must be placed there — other candidates in these cells can be eliminated.
fr: Ces chiffres doivent donc y être placés — les autres candidats de ces cellules peuvent être éliminés.
zh_hans: 这些数字必须放在此处——这些单元格中的其他候选数可以被排除。

source: These highlighted cells form a %1$@ pattern, so %2$lld must stay inside those %3$lld %4$@.
fr: Ces cellules mises en évidence forment un motif %1$@, donc %2$lld doit rester dans ces %3$lld %4$@.
zh_hans: 这些高亮单元格形成了%1$@模式，因此%2$lld必须保留在这%3$lld个%4$@中。

source: This forces: %@.
fr: Cela force : %1$@.
zh_hans: 这会强制得到：%1$@。

source: This puzzle doesn't exist.
fr: Ce puzzle n'existe pas.
zh_hans: 该谜题不存在。

source: This quick guide shows the goal of the puzzle, the touch gestures used in the grid, and the tools available while you play.
fr: Ce guide rapide présente l'objectif de la grille, les gestes tactiles utilisés sur la grille et les outils disponibles pendant la partie.
zh_hans: 这份简短指南会介绍谜题目标、棋盘上的触控手势，以及游玩时可用的工具。

# Three corners of the rectangle already contain only %@: %@.
source: Three corners of the rectangle already contain only %1$@: %2$@.
fr: Trois coins du rectangle ne contiennent déjà que %1$@ : %2$@.
zh_hans: 矩形的三个角已经只包含%1$@：%2$@。

source: Time
fr: Temps
zh_hans: 用时

source: Tracks how many hints or reveals you have used.
fr: Indique combien d'indices ou de révélations vous avez utilisés.
zh_hans: 统计你已经使用了多少次提示或揭示。

# Try each candidate at row %lld, column %lld.
source: Try each candidate at row %1$lld, column %2$lld.
fr: Essayez chaque candidat à la ligne %1$lld, colonne %2$lld.
zh_hans: 尝试第%1$lld行第%2$lld列的每个候选数。

source: Undo
fr: Annuler
zh_hans: 撤销

source: Unique Rectangle
fr: Rectangle unique
zh_hans: 唯一矩形

source: Unique Rectangle on %@: eliminating %@ from the non-bivalue cell avoids a pattern with no unique solution.
fr: Rectangle unique sur %1$@ : éliminer %2$@ de la cellule non-bivalue évite un pattern sans solution unique.
zh_hans: 唯一矩形（%1$@）：从非双值单元格中排除%2$@以避免无唯一解的模式。

source: Unique Rectangle on %1$@: removing those digits from %2$@ avoids a non-unique solution.
fr: Rectangle unique sur %1$@ : retirer ces chiffres de %2$@ évite une solution non unique.
zh_hans: 关于%1$@的唯一矩形：从%2$@删除这些数字可避免非唯一解。

source: Use a long press to erase a guess or notes from a cell you can modify.
fr: Utilisez un appui long pour effacer une valeur saisie ou des notes dans une case modifiable.
zh_hans: 长按可清除你可修改单元格中的填数或笔记。

source: Use the keypad to choose the number you want to work with.
fr: Utilisez le clavier pour choisir le chiffre avec lequel vous voulez jouer.
zh_hans: 使用数字键盘选择你想操作的数字。

source: Wand
fr: Baguette
zh_hans: 魔棒

source: Welcome to Sudoku
fr: Bienvenue dans Sudoku
zh_hans: 欢迎来到数独

source: What the Header Tells You
fr: Ce que l'en-tête vous indique
zh_hans: 标题栏会告诉你什么

source: Whatever the pivot becomes, one wing must take %1$lld, so common peers %2$@ cannot keep %3$lld.
fr: Quelle que soit la valeur du pivot, une aile doit prendre %1$lld, donc les pairs communs %2$@ ne peuvent pas garder %3$lld.
zh_hans: 无论枢轴取何值，必有一个翼取%1$lld，因此共同同伴格%2$@不能保留%3$lld。

source: When you are confident, a double tap writes the selected number into the grid.
fr: Quand vous êtes sûr de vous, un double toucher inscrit le chiffre sélectionné dans la grille.
zh_hans: 当你确定时，双击会把所选数字直接填入棋盘。

# Wing %@ links %lld to %lld, and wing %@ links %lld to %lld.
source: Wing %1$@ links %2$lld to %3$lld, and wing %4$@ links %5$lld to %6$lld.
fr: L'aile %1$@ relie %2$lld à %3$lld, et l'aile %4$@ relie %5$lld à %6$lld.
zh_hans: 翼%1$@将%2$lld与%3$lld相连，而翼%4$@将%5$lld与%6$lld相连。

# Wings %@ and %@ together cover the same three digits and both include %lld.
source: Wings %1$@ and %2$@ together cover the same three digits and both include %3$lld.
fr: Les ailes %1$@ et %2$@ couvrent ensemble les mêmes trois chiffres et incluent toutes deux %3$lld.
zh_hans: 翼%1$@和%2$@共同覆盖相同的三个数字，并且都包含%3$lld。

source: Would you like to replay puzzle #%lld?
fr: Voulez-vous rejouer le puzzle #%lld ?
zh_hans: 您想重玩谜题 #%lld 吗？

source: WXYZ-Wing: the highlighted pattern forces %1$lld to stay inside it, so common peers lose %2$lld.
fr: WXYZ-Wing : le motif mis en évidence force %1$lld à rester à l'intérieur, donc les pairs communs perdent %2$lld.
zh_hans: WXYZ-Wing：高亮模式迫使%1$lld留在其中，因此共同同伴格要删除%2$lld。

source: WXYZ-Wing: the pivot and its three wings allow eliminating %lld from common cells.
fr: WXYZ-Wing : le pivot et ses trois ailes permettent d'éliminer %lld des cellules communes.
zh_hans: WXYZ-Wing：枢纽和三个翼可以从公共单元格中排除%lld。

source: XY-Wing: the pivot and its two wings allow eliminating %lld from cells that see both wings.
fr: XY-Wing : le pivot et ses deux ailes permettent d'éliminer %lld des cellules qui voient les deux ailes.
zh_hans: XY-Wing：枢纽和两个翼可以从能同时看到两翼的单元格中排除%lld。

source: XY-Wing: the pivot forces one of its two wings to become %1$lld, so any cell seeing both wings loses %2$lld.
fr: XY-Wing : le pivot force l'une de ses deux ailes à devenir %1$lld, donc toute cellule voyant les deux ailes perd %2$lld.
zh_hans: XY-Wing：枢轴迫使它的两个翼之一变成%1$lld，因此任何同时看到两个翼的单元格都要删除%2$lld。

source: XYZ-Wing: the pivot and its two wings allow eliminating %lld from cells that see all three.
fr: XYZ-Wing : le pivot et ses deux ailes permettent d'éliminer %lld des cellules qui voient les trois.
zh_hans: XYZ-Wing：枢纽和两个翼可以从能同时看到三者的单元格中排除%lld。

source: XYZ-Wing: the pivot and its two wings force %1$lld to appear inside the pattern, so common peers lose %2$lld.
fr: XYZ-Wing : le pivot et ses deux ailes forcent %1$lld à apparaître dans le motif, donc les pairs communs perdent %2$lld.
zh_hans: XYZ-Wing：枢轴及其两个翼迫使%1$lld出现在该模式内部，因此共同同伴格要删除%2$lld。

source: You can reopen this tutorial any time from the information menu in the toolbar.
fr: Vous pouvez rouvrir ce tutoriel à tout moment depuis le menu d'information de la barre d'outils.
zh_hans: 你可以随时通过工具栏中的信息菜单重新打开本教程。

source: You successfully solved the puzzle.
fr: Vous avez résolu le puzzle avec succès.
zh_hans: 您已成功解开谜题。

source: Your current progress will be lost.
fr: Votre progression actuelle sera perdue.
zh_hans: 当前进度将会丢失。

source: Expert
zh_hans: 专家

source: Indigo
zh_hans: 靛蓝

source: Jellyfish
zh_hans: 水母

source: Orange
zh_hans: 橙色

source: Puzzle #%lld
zh_hans: 谜题 #%lld

source: Standard
zh_hans: 标准

source: Swordfish
zh_hans: 剑鱼

source: Techniques
zh_hans: 技巧
